#2) მოიყვანეთ while loop-ის მაგალითი და კომენტარის სახით ახსენით, თუ როგორ მუშაობს while ციკლი;
#while loop არის კოდი რომლილაც შეუძლია უსასრულობამდე დაწეროს რაც უნდა

#3) კომენტარის სახით ახსენით თუ რა განსხვავებაა for loop-სა და while loop-ს შორის 
#for loop და while loop შორის დიდი განსხვავება არ არის, რეთადერთი while loop შეუძლია უსასრულოდ გაგრძელდეს

#4)გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
i = 1
while i<14:
    print("ანდრია სოლოღაშვილი")
    i = i+1

#5)გამოიტანეთ რიცხვები 10-დან 15-მდე

i = 10
while i<=15:
    print(i)
    i=i+1