#1)მომხარებელს  შემოატანინე  ასაკი (input) ით და შეინახეთ ეგ ცვლადში და შემდეგ დაპრინტე 

age = input("შეიყვანეთ თქვენი ასაკი : ")

print (age)

#2)მომხარებელს შემოატანინე სახელი, და შემდეგ მიესალმე, "გამარჯობა", სახელი

name = input("რა გქვია? : ")
print ("გამარჯობა" + name)

#3)კომენტარების სახით ახსენი რა არის input და output
#input - შეყვანა
#output - გამოშვება

#4) debugging (გაასწორეთ შეცდომები ამ კოდში)  6name = gurami  print(6Name)
#პრინტ კომანდის გამოყენების შემდეგ არაფერი არ გამოიტანა რადგან "6name" არის არასწორედ დაწერილი,ასევე არ შეიძლება ციფრების გამოყენება ცვლადში 

#სწორი იქნება-
#name = "gurami"
#print(name)

#5)boss level:მომხარებელს შემოატანიენ თავისი ასაკი და რომელ წელშიც ცხოვრობს, და დაუპრინტეთ 10 წელში რამდენი წლის იქნება და რომელი წელი იქნება მაშინ

name = input ("რამდენი წლის ხარ შენ? : ")
year = input ("რომელ წელს ცხოვრობა? : ")

#6)კომენტარების სახით ახსენი snake_case და camelCase

#snake_case - როდესაც მომხმარებელი იყენებს undercove space მაგივრად 
#camelCase - როდესაც მეორე სიტყვა იწყება დიდი ასოთი space მაგივრად

#7)დაწერეთ ცვლადის სწორი და ცვლადის არასწორი შექმნსი გზები
#არასწორი - name1 = (andria)
#სწორი - name = ("andria")