#1)კომენტარების სახით ახსენით რამდენი შედარების ოპერატორია და თითოეული რისთვის გამოიყენება
#1.== - ამოწმებს თუ ერთნაირი მნიშვნელობა აქვს ორ რიცხვს(4 == 4)
#2.< - ამოწმებს თუ პირველი რიცხვი ნაკლებია მეორეზე (4 < 5)
#3.> - ამოწმებს თუ პირველი რიცხვი მეტია მეორეზე(4 > 3)
#3.<= - ამოწმებს თუ პირველი ნაკლებია ან ტილი მეორეზე(4 <= 4 ან 4 <= 5)
#4.>= - ამოწმებსს თუ პირველი მეტია ან ტოლი მეორეზე(4 >= 4 ან 4 >= 3)
#5.!= - ამოწმებს თუ ორივე განსხვავებულია ერთმანეთისგან (4 != 5)

#2)კომენტარების სახით ახსენი რა განსხვავებაა and და or ლოგიკურ ოპერატორებს შორის და რა თვისებები გააჩნიათ

#and ლოგიკური ოპერატორის დაწერის დროს თუ დაიწერება "true and false" მაშინ ამოაგდებს ყოველთვის "false" რადგან საჭიროა რომ დაიწეროს ორი "true"  (12 and 11)= 11
#or ლოგიკური ოპერატორის დაწერის დროს თუ დაიწერება "true or false" მაშნ ამოაგდებს ყოველთვის "true" ანუ უფრი დიდ მნიშვნელობას (12 or 11)= 12

#3)გაარჩიეთ შემდეგი წინადადება ნაბიჯ ნაბიჯ და საბოლოოდ მიიღეთ ის პასუხი რომელიც ტერმინალში გამოვა 
#print(True and 6<7 or "hello"!=5.4 and False or 7-7 < 9+2)
#1.(True and 6<7) = True
#2."hello"!=5.4 = True
#3.False or 7-7 < 9+2 = False
#4.True and True or False = False 

#4)კომენტარების სახით ახსენი რომელ მონაცემთა ტიპებთან შეგვიძლია გამოვიყენოთ გარკვეული შედარების ოპერატორები
#str, int და float -თან შეგვიძლია ყველა შედარების ოპერატორები გამოვიყენოთ

#5)დაპრინტეთ ყველა შესაძლო ვარიანტი and და or ით
 
print(True and False)
print(True and True)
print(False and False)
print(False and True)

print(True or False)
print(True or True)
print(False or False)
print(False or True)




